##### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
series=pd.Series(data=[4,8,15,16,23,42])

In [2]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

##### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [5]:
numbers=[i for i in range(1,11)]
pandas_series=pd.Series(data=numbers)

In [6]:
pandas_series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

##### Q3. Create a Pandas DataFrame that contains the following data:

In [13]:
dictionary={
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']
}

In [14]:
table=pd.DataFrame(dictionary)

In [15]:
table

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

##### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

    DataFrame is a data structure in a pandas library used for storing and manipulating the tabular data. 
    It is able to hold a multiple columns ,each of which can be different datatypes.

    While, Series is a one dimensional labeled array-like-object.

In [19]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 22],
        'Country': ['USA', 'Canada', 'UK']}
df = pd.DataFrame(data)

ages = pd.Series([25, 30, 22], name='Age')

print("DataFrame:")
df

DataFrame:

      Name  Age Country
0    Alice   25     USA
1      Bob   30  Canada
2  Charlie   22      UK

In [18]:
print("\nSeries:")
print(ages)

Series:
0    25
1    30
2    22
Name: Age, dtype: int64

##### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Pandas have many functions for manipulating data within a DataFrame

1. head() and tail() :
   head() allows us to view the first few rows and tail() allows to last rows.

In [20]:
df.head(2)

    Name  Age Country
0  Alice   25     USA
1    Bob   30  Canada

In [21]:
df.tail(2)

      Name  Age Country
1      Bob   30  Canada
2  Charlie   22      UK

2. info( ) : It provides the summary of the dataframe including datatype,non null values and memory usage.

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Age      3 non-null      int64
 2   Country  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

3. describe() : It generates the summary statistics for a numerical column in Dataframe.

In [23]:
df.describe()

             Age
count   3.000000
mean   25.666667
std     4.041452
min    22.000000
25%    23.500000
50%    25.000000
75%    27.500000
max    30.000000

4. shape : It return the tuple representing the dimensions of the DataFrame

In [24]:
df.shape

(3, 3)

5. loc[] and iloc[] : The functions are used for indexing and selecting data by label or integer position.

In [32]:
df.iloc[:,1]

0    25
1    30
2    22
Name: Age, dtype: int64

In [26]:
df.loc[0]

Name       Alice
Age           25
Country      USA
Name: 0, dtype: object

6. groupby(): This function is used for grouping data based on one or more columns and applying aggregate functions.

In [36]:
df.groupby('Country')['Age'].mean()

Country
Canada    30.0
UK        22.0
USA       25.0
Name: Age, dtype: float64

7. sort_values(): This function sorts the DataFrame by one or more columns.

In [37]:
sorted_df=df.sort_values(by='Age')

In [38]:
sorted_df

      Name  Age Country
2  Charlie   22      UK
0    Alice   25     USA
1      Bob   30  Canada

##### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
DataFrame and Series is mutable in nature while panel is not mutable in nature.Mutable means we can change the values,modify rows and columns .

##### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [41]:
li1=[i for i in range(1,11)]
li2=[i for i in range(11,21)]
li3=[i for i in range(21,31)]

In [42]:
ser1=pd.Series(li1)
ser2=pd.Series(li2)
ser3=pd.Series(li3)

In [43]:
pd.DataFrame({
    'Column1':ser1,
    'Column2':ser2,
    'Column3':ser3
})

   Column1  Column2  Column3
0        1       11       21
1        2       12       22
2        3       13       23
3        4       14       24
4        5       15       25
5        6       16       26
6        7       17       27
7        8       18       28
8        9       19       29
9       10       20       30